In [2]:
import numpy as np
import pandas as pd

In [5]:
#Series找出缺失数据
data1 = pd.Series(['a','b',np.NAN,'c'])
data1.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [7]:
#Series滤除缺失数据
data1.dropna()
data1[data1.notnull()]

0    a
1    b
3    c
dtype: object

In [8]:
data2 = pd.DataFrame([[1,6.5,3],[1,np.nan,np.nan],[np.nan,np.nan,np.nan],[np.nan,6.7,7]])
data2

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.7  7.0

In [19]:
#DataFrame滤除缺失数据
data2.dropna()  #删除含有nan的行
data2.dropna(how='all')  #丢弃全为nan的行  参数how='all'只针对行
data2.dropna(axis=1,how='all')
data2.dropna(axis=1) #删除含有nan的列
data2.dropna(thresh=2) #删除有两个缺失值的数据

     0    1    2
0  1.0  6.5  3.0
3  NaN  6.7  7.0

## 填充缺失值

In [26]:
data2.fillna(0) #NAN替换为0
data2.fillna({1:0.9,2:0}) # 索引为1列的缺失值替换为0.9，索引为2列的缺失值替换为0
data2.fillna(method='ffill') #当出现NAN，则用NAN前面不是空缺的值填充
data2.fillna(method='ffill',limit=2) #limit=2指定填充次数

     0    1    2
0  1.0  6.5  3.0
1  1.0  6.5  3.0
2  1.0  6.5  3.0
3  1.0  6.7  7.0

## 移除重复数据

In [27]:
data = pd.DataFrame({'k1':['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [31]:
#检查重复数据
data.duplicated()
#删除重复数据
data.drop_duplicates()
#指定删除重复值的列
data.drop_duplicates(['k2'],keep='last')  #不写keep='last'默认保留第一次出现重复值的组合，写了保留最后一次

    k1  k2
1  two   1
2  one   2
4  one   3
6  two   4